status/2021/16apr21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>10 April 2021 - 16 April 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">10 April 2021 - 16 April 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfddb6f9">1. Santa Cruz Weather Station</a>
<ul>
<li><a href="#org15dc4be">1.1. Next step</a>
<ul>
<li><a href="#orgfd24979">1.1.1. Construct DB9M test cable.</a></li>
<li><a href="#org2017483">1.1.2. Test sensors.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd5567a3">2. EPICS</a>
<ul>
<li><a href="#orgd93715a">2.1. Next steps</a>
<ul>
<li><a href="#orgc21429b">2.1.1. u3scpi network port testing</a></li>
<li><a href="#org3c3fe53">2.1.2. initial EPICS interface</a></li>
<li><a href="#org4c45fe8">2.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd69d060">3. Brini Tracker II</a>
<ul>
<li><a href="#org2084a53">3.1. Fixed A/D</a></li>
<li><a href="#org2dd2e90">3.2. Fixed GPS NMEA reader</a></li>
<li><a href="#org79cc4e2">3.3. Next steps</a>
<ul>
<li><a href="#orge70f496">3.3.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org6a82760">3.3.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org0cb193c">3.3.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga3885f9">4. Weber Grill Handles</a></li>
<li><a href="#orgdc46556">5. wktcolor</a>
<ul>
<li><a href="#org601be74">5.1. Next steps</a>
<ul>
<li><a href="#orgee31bde">5.1.1. finish wktlib c++ export.</a></li>
<li><a href="#orgc8139b4">5.1.2. create vertex map for geometry importer</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9417a30">6. ca-r</a>
<ul>
<li><a href="#org97f4655">6.1. Next Step</a>
<ul>
<li><a href="#org0a3c27a">6.1.1. Fix issue 18</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc0fe27b">7. AMDGPU</a>
<ul>
<li><a href="#org83900d9">7.1. Next steps</a>
<ul>
<li><a href="#org0be26bd">7.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf4eaf78">8. GRASS geopackage import</a></li>
<li><a href="#org7dd5e23">9. Tessellation</a></li>
<li><a href="#org7ab7b6c">10. Ninja v Make</a>
<ul>
<li><a href="#org27ed842">10.1. Next Step</a>
<ul>
<li><a href="#org263ce9c">10.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org25ebac5">11. Plumbing</a></li>
</ul>
</div>
</div>
<p>
Overcoming frustration
</p>

<div id="outline-container-orgfddb6f9" class="outline-2">
<h2 id="orgfddb6f9"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Mast sensors still broken <b>but</b> started a test jig.
Using a subset of 'HHEM' as a test program.
</p>
</div>
<div id="outline-container-org15dc4be" class="outline-3">
<h3 id="org15dc4be"><span class="section-number-3">1.1.</span> Next step</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgfd24979" class="outline-4">
<h4 id="orgfd24979"><span class="section-number-4">1.1.1.</span> Construct DB9M test cable.</h4>
</div>
<div id="outline-container-org2017483" class="outline-4">
<h4 id="org2017483"><span class="section-number-4">1.1.2.</span> Test sensors.</h4>
</div>
</div>
</div>
<div id="outline-container-orgd5567a3" class="outline-2">
<h2 id="orgd5567a3"><span class="section-number-2">2.</span> EPICS</h2>
<div class="outline-text-2" id="text-2">
<p>
No progress. Now that the Brini Tracker A/D is working (which was
the original motivation for getting U3 stuff working), this is no
longer "critical path" - not like anything is critical in this list.
</p>
</div>
<div id="outline-container-orgd93715a" class="outline-3">
<h3 id="orgd93715a"><span class="section-number-3">2.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgc21429b" class="outline-4">
<h4 id="orgc21429b"><span class="section-number-4">2.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org3c3fe53" class="outline-4">
<h4 id="org3c3fe53"><span class="section-number-4">2.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org4c45fe8" class="outline-4">
<h4 id="org4c45fe8"><span class="section-number-4">2.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>
<div id="outline-container-orgd69d060" class="outline-2">
<h2 id="orgd69d060"><span class="section-number-2">3.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2084a53" class="outline-3">
<h3 id="org2084a53"><span class="section-number-3">3.1.</span> Fixed A/D</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Readings were pegged because RIOT by default uses the 1V internal
reference, but the Adafruit M0 board assumes an external 3.3V
reference so it uses a 100k:100k voltage divider for VBAT
measurements, which I in turn used for the VBUS measurement.
</p>

<p>
I don't want to change the RIOT default A/D configuration, so I am
using a 470k:100k divider for both VBAT and VBUS and ignore the
internal VBAT divider.
</p>
</div>
</div>

<div id="outline-container-org2dd2e90" class="outline-3">
<h3 id="org2dd2e90"><span class="section-number-3">3.2.</span> Fixed GPS NMEA reader</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Essentially the ringbuffer/message passing algorithm between the
UART RX and the NMEA parser was broken. Using tsrb (Thread Safe
Ring Buffer!) instead of ringbuffer. Not tracking line lengths but
explicitly using '*' and '\n' start and end line markers.
</p>

<p>
Time display now consistently updates.
</p>
</div>
</div>

<div id="outline-container-org79cc4e2" class="outline-3">
<h3 id="org79cc4e2"><span class="section-number-3">3.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-orge70f496" class="outline-4">
<h4 id="orge70f496"><span class="section-number-4">3.3.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org6a82760" class="outline-4">
<h4 id="org6a82760"><span class="section-number-4">3.3.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org0cb193c" class="outline-4">
<h4 id="org0cb193c"><span class="section-number-4">3.3.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>
<div id="outline-container-orga3885f9" class="outline-2">
<h2 id="orga3885f9"><span class="section-number-2">4.</span> Weber Grill Handles</h2>
<div class="outline-text-2" id="text-4">
<p>
Made new birch handles for Weber grill.
</p>
</div>
</div>
<div id="outline-container-orgdc46556" class="outline-2">
<h2 id="orgdc46556"><span class="section-number-2">5.</span> wktcolor</h2>
<div class="outline-text-2" id="text-5">
<p>
No progress.
</p>
</div>
<div id="outline-container-org601be74" class="outline-3">
<h3 id="org601be74"><span class="section-number-3">5.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orgee31bde" class="outline-4">
<h4 id="orgee31bde"><span class="section-number-4">5.1.1.</span> finish wktlib c++ export.</h4>
</div>
<div id="outline-container-orgc8139b4" class="outline-4">
<h4 id="orgc8139b4"><span class="section-number-4">5.1.2.</span> create vertex map for geometry importer</h4>
</div>
</div>
</div>

<div id="outline-container-org9417a30" class="outline-2">
<h2 id="org9417a30"><span class="section-number-2">6.</span> ca-r</h2>
<div class="outline-text-2" id="text-6">
<p>
See <a href="https://github.com/daniel-kelley/ca-r/issues/18">https://github.com/daniel-kelley/ca-r/issues/18</a>
</p>
</div>
<div id="outline-container-org97f4655" class="outline-3">
<h3 id="org97f4655"><span class="section-number-3">6.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org0a3c27a" class="outline-4">
<h4 id="org0a3c27a"><span class="section-number-4">6.1.1.</span> Fix issue 18</h4>
</div>
</div>
</div>
<div id="outline-container-orgc0fe27b" class="outline-2">
<h2 id="orgc0fe27b"><span class="section-number-2">7.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-7">
<p>
For (likely) business reasons, AMD has chosen to prioritize non-APU devices for ROCm support.
Such devices also require ACPI BIOS support, which may or may not be available. In my case,
the CRAT table is incorrect according to the AMDGPU driver.
</p>

<p>
Either I need to wait to see if APU support will catch up, or
construct a HSA compatible runtime based on the AMDGPU driver, or
hack AMDGPU for APUs until it works with the released HSA runtime.
</p>

<p>
In either case, this will be a major time commitment if it goes
forward.
</p>
</div>
<div id="outline-container-org83900d9" class="outline-3">
<h3 id="org83900d9"><span class="section-number-3">7.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org0be26bd" class="outline-4">
<h4 id="org0be26bd"><span class="section-number-4">7.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>
<div id="outline-container-orgf4eaf78" class="outline-2">
<h2 id="orgf4eaf78"><span class="section-number-2">8.</span> GRASS geopackage import</h2>
<div class="outline-text-2" id="text-8">
<p>
Maureen asked me to evaluate the feasibility of importing one of her
GIS projects to GRASS. It's possible if the database gets cleaned up
as there were about 20 points with illegal coordinates.
</p>

<p>
<b>DONE</b>
</p>
</div>
</div>

<div id="outline-container-org7dd5e23" class="outline-2">
<h2 id="org7dd5e23"><span class="section-number-2">9.</span> Tessellation</h2>
<div class="outline-text-2" id="text-9">
<p>
Playing with 2x2 and 2x3 blocks, inspired by the back patio brickwork.
</p>

<p>
Questions:
</p>

<p>
What is the algorithm to fill a rectangular area with random tile placement?
</p>

<p>
What are the number of unique arrangements not counting rotations and reflections?
</p>
</div>
</div>

<div id="outline-container-org7ab7b6c" class="outline-2">
<h2 id="org7ab7b6c"><span class="section-number-2">10.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-10">
<p>
LLVM can use both Ninja and Make build systems with a preference for ninja.
Started a simple measurement, but ran out of disk space(!).
</p>
</div>
<div id="outline-container-org27ed842" class="outline-3">
<h3 id="org27ed842"><span class="section-number-3">10.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-org263ce9c" class="outline-4">
<h4 id="org263ce9c"><span class="section-number-4">10.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>
<div id="outline-container-org25ebac5" class="outline-2">
<h2 id="org25ebac5"><span class="section-number-2">11.</span> Plumbing</h2>
<div class="outline-text-2" id="text-11">
<p>
Santa Cruz kitchen sink has been slow draining, so I tried snaking
it, and made it worse - now it doesn't drain at all. A real plumber
has been called and he has been finding it a challenge. Trish called
out her assumption that the plumber was going to be a man.
</p>

<p>
Likely, but maybe things will change eventually:
</p>

<p>
<a href="https://www.servicetitan.com/blog/women-in-plumbing">https://www.servicetitan.com/blog/women-in-plumbing</a>
</p>

<p>
<b>Hopefully Done</b>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>